{
  "serverless-cloud-function-application": {
	"Chinese":{
		"name": "COS费用保护",                   #请填写模版中文名称，如果是java模版，必须和jar文件的名称一致，其他语言不做限制。前台需要展示，请认真填写，名称要具有一定的意义，名称里统一剥离掉runtime。
		"description": "在某些COS存储桶需要设置为公共读的场景下，通过结合云监控的多种监控纬度并判断阈值，将存储桶的ACL及时修改为私有读写状态，从而在盗刷场景保护存储桶的费用流失，及时止损。",            #模版描述，主要是介绍该模版的用途、用法、涉及到的关键技术等，用户可以通过该关键字搜索。前台需要展示，请认真填写，支持中文。
		"attention": "本场景不适合CDN回源鉴权，在私有读写状态，CDN回源请求仍然可以通过签名访问访问，从而产生CDN回源流量。",    #模版使用的注意事项，在模板查看详情里展示。
		"author": {
			"name": "孙伟"                       #作者
		}
	},
	"English":{
		"name": "COS_limit_spending_Demo",                       # 英文名称确定后不可修改且需要所有 demo 唯一，建议填写文件夹名称（去掉runtime）信息。例如：文件夹名称“Python3.6-newdemo”，英文名称为“newdemo”。This is the English name of demo. If it is java demo. Please keep the same name with jar package. No restrictions for non-java demos. Please do not add runtime information in the name.
		"description": "In some scenarios where the COS bucket needs to be set to public read, the ACL of the bucket can be modified to private read/write status in a timely manner by combining multiple monitoring dimensions of cloud monitoring and determining thresholds, thereby protecting the bucket from loss and stopping losses in a timely manner in the theft scenario.",      # The description of demo. You can describe the detail function.
		"attention": "This scenario is not suitable for CDN back-to-source authentication. In a private read/write state, CDN back-to-source requests can still be accessed through signature access, resulting in CDN back-to-source traffic.",  # The precautions for using the template will be shown in the view details.
		"author": {
			"name": "WeiSun"                       # author English Name
		}
	},		
    "runtime": "Python3.6",                      #运行环境，用户可以通过该关键字搜索，请在下述已经支持的运行环境中选择一个填入。前台需要展示，请认真填写。["Python3.6","Python2.7","Node.js12.16","Node.js10.15","Node.js8.9","Nodejs6.10","Php7","Php5","Java8","Golang1","CustomRuntime"]
        "type": "event",                             #模版类型，事件函数填event，web函数填web，应用填app。前台需要展示，请认真填写。填写错误可能导致模版部署异常。
        "readme":"https://github.com/colasun/serverless-demo",                      #模版同步的唯一标识，必填。
        "version": "1.0.0",                          #版本号，通过版本号校验模版更新情况，未修改版本号会导致模版无法同步更新到控制台。
        "tags":[
            "Python3.6", "COS"
        ]                                            #标签统一为英文，可编写多个，建议第一个标签为runtime，其他标签为触发器、场景等关键字，不同标签之间用英文逗号间隔，用户可以通过该关键字搜索。前台需要展示，请认真填写，不支持中文。
    }
}